FlyyingPiggy2020/board/stm32f103/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*   函 数 名: ComToUart
*   功能说明: 将COM端口号转换为 USART_TypeDef* USARTx
*   形    参: _ucPort: 端口号(COM1 - COM8)
*   返 回 值: USART_TypeDef*,  USART1, USART2, USART3, UART4,
*UART5，USART6，UART7，UART8。
*********************************************************************************************************
*/
USART_TypeDef *ComToUSARTx(COM_PORT_E _ucPort) {
  if (_ucPort == COM1) {
#if UART1_FIFO_EN == 1
    return USART1;
#else
    return 0;
#endif
  } else if (_ucPort == COM2) {
#if UART2_FIFO_EN == 1
    return USART2;
#else
    return 0;
#endif
  } else if (_ucPort == COM3) {
#if UART3_FIFO_EN == 1
    return USART3;
#else
    return 0;
#endif
  } else if (_ucPort == COM4) {
#if UART4_FIFO_EN == 1
    return UART4;
#else
    return 0;
#endif
  } else if (_ucPort == COM5) {
#if UART5_FIFO_EN == 1
    return UART5;
#else
    return 0;
#endif
  } else if (_ucPort == COM6) {
#if UART6_FIFO_EN == 1
    return USART6;
#else
    return 0;
#endif
  } else {
    /* 不做任何处理 */
    return 0;
  }
}

/*
*********************************************************************************************************
*   函 数 名: ComToUart
*   功能说明: 将COM端口号转换为UART指针
*   形    参: _ucPort: 端口号(COM1 - COM6)
*   返 回 值: uart指针
*********************************************************************************************************
*/
UART_T *comTxToUart(USART_TypeDef *_uart) {
  if (_uart == USART1) {
#if UART1_FIFO_EN == 1
    return &g_tUart1;
#else
    return 0;
#endif
  } else if (_uart == USART2) {
#if UART2_FIFO_EN == 1
    return &g_tUart2;
#else
    return 0;
#endif
  } else if (_uart == USART3) {
#if UART3_FIFO_EN == 1
    return &g_tUart3;
#else
    return 0;
#endif
  }
#if UART4_FIFO_EN == 1
  else if (_uart == UART4) {
#if UART4_FIFO_EN == 1
    return &g_tUart4;
#else
    return 0;
#endif
  }
#endif
#if UART5_FIFO_EN == 1
  else if (_uart == UART5) {
#if UART5_FIFO_EN == 1
    return &g_tUart5;
#else
    return 0;
#endif
  }
#endif
#if UART6_FIFO_EN == 1
  else if (_uart == USART6) {
#if UART6_FIFO_EN == 1
    return &g_tUart6;
#else
    return 0;
#endif
  }
#endif
  else {
    bsp_Error_Handler(__FILE__, __LINE__);
    return 0;
  }
}

/*
*********************************************************************************************************
*   函 数 名: comSendBuf
*   功能说明:
*向串口发送一组数据。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _ucaBuf: 待发送的数据缓冲区
*             _usLen : 数据长度
*   返 回 值: 无
*********************************************************************************************************
*/
int32_t comSendBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen) {
  UART_T *pUart;

  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return -1;
  }

  if (pUart->SendBefor != 0) {
    pUart->SendBefor(
        pUart
            ->com); /* 如果是RS485通信，可以在这个函数中将RS485设置为发送模式 */
  }

  return UartSend(pUart, _ucaBuf, _usLen);
  ;
}

/*
*********************************************************************************************************
*   函 数 名: comSendChar
*   功能说明:
*向串口发送1个字节。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _ucByte: 待发送的数据
*   返 回 值: 无
*********************************************************************************************************
*/
void comSendChar(COM_PORT_E _ucPort, uint8_t _ucByte) {
  comSendBuf(_ucPort, &_ucByte, 1);
}

/*
*********************************************************************************************************
*   函 数 名: comGetChar
*   功能说明: 从接收缓冲区读取1字节，非阻塞。无论有无数据均立即返回。
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _pByte: 接收到的数据存放在这个地址
*   返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint8_t comGetChar(COM_PORT_E _ucPort, uint8_t *_pByte) {
  UART_T *pUart;

  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return 0;
  }

  return UartGetChar(pUart, _pByte);
}

/*
*********************************************************************************************************
*   函 数 名: comSetBuf
*   功能说明: 从接收缓冲区放入多个字节，非阻塞。无论有无数据均立即返回。
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _pByte: 接收到的数据存放在这个地址
*   返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint16_t comSetBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen) {
  UART_T *pUart;

  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return 0;
  }

  return UartSetBuf(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*   函 数 名: comGetBuf
*   功能说明: 从接收缓冲区读取多个字节，非阻塞。无论有无数据均立即返回。
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _pByte: 接收到的数据存放在这个地址
*   返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint16_t comGetBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen) {
  UART_T *pUart;

  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return 0;
  }

  return UartGetBuf(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*   函 数 名: comClearTxFifo
*   功能说明: 清零串口发送缓冲区
*   形    参: _ucPort: 端口号(COM1 - COM8)
*   返 回 值: 无
*********************************************************************************************************
*/
void comClearTxFifo(COM_PORT_E _ucPort) {
  UART_T *pUart;

  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return;
  }

  pUart->usTxWrite = 0;
  pUart->usTxRead = 0;
  pUart->usTxCount = 0;
}

/*
*********************************************************************************************************
*   函 数 名: comClearRxFifo
*   功能说明: 清零串口接收缓冲区
*   形    参: _ucPort: 端口号(COM1 - COM8)
*   返 回 值: 无
*********************************************************************************************************
*/
void comClearRxFifo(COM_PORT_E _ucPort) {
  UART_T *pUart;

