FlyyingPiggy2020/board/stm32f103/src/bsp_uart_fifo.c
  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return;
  }

  pUart->usRxWrite = 0;
  pUart->usRxRead = 0;
  pUart->usRxCount = 0;
}

/*
*********************************************************************************************************
*   函 数 名: comSetBaud
*   功能说明: 设置串口的波特率. 本函数固定设置为无校验，收发都使能模式
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _BaudRate: 波特率，8倍过采样  波特率.0-12.5Mbps
*                                16倍过采样 波特率.0-6.25Mbps
*   返 回 值: 无
*********************************************************************************************************
*/
void comSetBaud(COM_PORT_E _ucPort, uint32_t _BaudRate) {
  USART_TypeDef *USARTx;

  USARTx = ComToUSARTx(_ucPort);
  if (USARTx == 0) {
    return;
  }

  comSetUartParam(USARTx, _BaudRate, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX);
}

/* 如果是RS485通信，请按如下格式编写函数， 我们仅举了 USART3作为RS485的例子 */

/*
*********************************************************************************************************
*   函 数 名: RS485_InitTXE
*   功能说明: 配置RS485发送使能口线 TXE
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
void RS485_InitTXE(void) {
#if UART6_FIFO_EN == 1
  GPIO_InitTypeDef gpio_init;

  /* 打开GPIO时钟 */
  RS485_TXEN_GPIO_CLK_ENABLE();

  /* 配置引脚为推挽输出 */
  gpio_init.Mode = GPIO_MODE_OUTPUT_PP;   /* 推挽输出 */
  gpio_init.Pull = GPIO_NOPULL;           /* 上下拉电阻不使能 */
  gpio_init.Speed = GPIO_SPEED_FREQ_HIGH; /* GPIO速度等级 */
  gpio_init.Pin = RS485_TXEN_PIN;
  HAL_GPIO_Init(RS485_TXEN_GPIO_PORT, &gpio_init);
#endif
}

/*
*********************************************************************************************************
*   函 数 名: RS485_SetBaud
*   功能说明: 修改485串口的波特率。
*   形    参: _baud : 8倍过采样  波特率.0-12.5Mbps
*                     16倍过采样 波特率.0-6.25Mbps
*   返 回 值: 无
*********************************************************************************************************
*/
void RS485_SetBaud(COM_PORT_E _ucPort, uint32_t _baud) {
  comSetBaud(_ucPort, _baud);
}

/*
*********************************************************************************************************
*   函 数 名: RS485_SendBefor
*   功能说明: 发送数据前的准备工作。对于RS485通信，请设置RS485芯片为发送状态，
*             并修改 UartVarInit()中的函数指针等于本函数名，比如
*g_tUart2.SendBefor = RS485_SendBefor 形    参: 无 返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendBefor(COM_PORT_E com) {
  if (com == COM6) {
    RS485_TX_EN(); /* 切换RS485收发芯片为发送模式 */
  }
}

/*
*********************************************************************************************************
*   函 数 名: RS485_SendOver
*   功能说明:
*发送一串数据结束后的善后处理。对于RS485通信，请设置RS485芯片为接收状态， 并修改
*UartVarInit()中的函数指针等于本函数名，比如 g_tUart2.SendOver = RS485_SendOver
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendOver(COM_PORT_E com) {
  if (com == COM6) {
    RS485_RX_EN(); /* 切换RS485收发芯片为接收模式 */
  }
}

/*
*********************************************************************************************************
*   函 数 名: RS485_SendBuf
*   功能说明: 通过RS485芯片发送一串数据。注意，本函数不等待发送完毕。
*   形    参: _ucaBuf : 数据缓冲区
*             _usLen : 数据长度
*   返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendBuf(COM_PORT_E com, uint8_t *_ucaBuf, uint16_t _usLen) {
  comSendBuf(com, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*   函 数 名: RS485_SendStr
*   功能说明: 向485总线发送一个字符串，0结束。
*   形    参: _pBuf 字符串，0结束
*   返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendStr(COM_PORT_E com, char *_pBuf) {
  RS485_SendBuf(com, (uint8_t *)_pBuf, strlen(_pBuf));
}

/*
*********************************************************************************************************
*   函 数 名: RS485_ReciveNew
*   功能说明: 接收到新的数据
*   形    参: _byte 接收到的新数据
*   返 回 值: 无
*********************************************************************************************************
*/
void RS485_ReciveNew(COM_PORT_E com, uint8_t _byte) {}

/*
*********************************************************************************************************
*   函 数 名: UartVarInit
*   功能说明: 初始化串口相关的变量
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
static void UartVarInit(void) {
#if UART1_FIFO_EN == 1
  g_tUart1.com = COM1;                      /* 当前串口信息 */
  g_tUart1.uart = USART1;                   /* STM32 串口设备 */
  g_tUart1.pTxBuf = g_TxBuf1;               /* 发送缓冲区指针 */
  g_tUart1.pRxBuf = g_RxBuf1;               /* 接收缓冲区指针 */
  g_tUart1.usTxBufSize = UART1_TX_BUF_SIZE; /* 发送缓冲区大小 */
  g_tUart1.usRxBufSize = UART1_RX_BUF_SIZE; /* 接收缓冲区大小 */
  g_tUart1.usTxWrite = 0;                   /* 发送FIFO写索引 */
  g_tUart1.usTxRead = 0;                    /* 发送FIFO读索引 */
  g_tUart1.usRxWrite = 0;                   /* 接收FIFO写索引 */
  g_tUart1.usRxRead = 0;                    /* 接收FIFO读索引 */
  g_tUart1.usRxCount = 0;                   /* 接收到的新数据个数 */
  g_tUart1.usTxCount = 0;                   /* 待发送的数据个数 */
  g_tUart1.SendBefor = 0;                   /* 发送数据前的回调函数 */
  g_tUart1.SendOver = 0;                    /* 发送完毕后的回调函数 */
  g_tUart1.ReciveNew = 0; /* 接收到新数据后的回调函数 */
  g_tUart1.Sending = 0;   /* 正在发送中标志 */
  g_tUart1.IdleCallback = 0;
#endif

#if UART2_FIFO_EN == 1
  g_tUart2.com = COM2;                      /* 当前串口信息 */
  g_tUart2.uart = USART2;                   /* STM32 串口设备 */
  g_tUart2.pTxBuf = g_TxBuf2;               /* 发送缓冲区指针 */
  g_tUart2.pRxBuf = g_RxBuf2;               /* 接收缓冲区指针 */
  g_tUart2.usTxBufSize = UART2_TX_BUF_SIZE; /* 发送缓冲区大小 */
  g_tUart2.usRxBufSize = UART2_RX_BUF_SIZE; /* 接收缓冲区大小 */
  g_tUart2.usTxWrite = 0;                   /* 发送FIFO写索引 */
  g_tUart2.usTxRead = 0;                    /* 发送FIFO读索引 */
  g_tUart2.usRxWrite = 0;                   /* 接收FIFO写索引 */
  g_tUart2.usRxRead = 0;                    /* 接收FIFO读索引 */
  g_tUart2.usRxCount = 0;                   /* 接收到的新数据个数 */
  g_tUart2.usTxCount = 0;                   /* 待发送的数据个数 */
  g_tUart2.SendBefor = 0;                   /* 发送数据前的回调函数 */
  g_tUart2.SendOver = 0;                    /* 发送完毕后的回调函数 */
  g_tUart2.ReciveNew = 0; /* 接收到新数据后的回调函数 */
  g_tUart2.Sending = 0;   /* 正在发送中标志 */
  g_tUart2.IdleCallback = 0;
#endif

#if UART3_FIFO_EN == 1
  g_tUart3.com = COM3;                      /* 当前串口信息 */
  g_tUart3.uart = USART3;                   /* STM32 串口设备 */
  g_tUart3.pTxBuf = g_TxBuf3;               /* 发送缓冲区指针 */
  g_tUart3.pRxBuf = g_RxBuf3;               /* 接收缓冲区指针 */
  g_tUart3.usTxBufSize = UART3_TX_BUF_SIZE; /* 发送缓冲区大小 */
  g_tUart3.usRxBufSize = UART3_RX_BUF_SIZE; /* 接收缓冲区大小 */
  g_tUart3.usTxWrite = 0;                   /* 发送FIFO写索引 */
  g_tUart3.usTxRead = 0;                    /* 发送FIFO读索引 */
  g_tUart3.usRxWrite = 0;                   /* 接收FIFO写索引 */
  g_tUart3.usRxRead = 0;                    /* 接收FIFO读索引 */
  g_tUart3.usRxCount = 0;                   /* 接收到的新数据个数 */
  g_tUart3.usTxCount = 0;                   /* 待发送的数据个数 */
  g_tUart3.SendBefor = 0;                   /* 发送数据前的回调函数 */
  g_tUart3.SendOver = 0;                    /* 发送完毕后的回调函数 */
  g_tUart3.ReciveNew = 0; /* 接收到新数据后的回调函数 */
  g_tUart3.Sending = 0;   /* 正在发送中标志 */
#endif

#if UART4_FIFO_EN == 1
  g_tUart4.uart = UART4;                    /* STM32 串口设备 */
  g_tUart4.pTxBuf = g_TxBuf4;               /* 发送缓冲区指针 */
  g_tUart4.pRxBuf = g_RxBuf4;               /* 接收缓冲区指针 */
  g_tUart4.usTxBufSize = UART4_TX_BUF_SIZE; /* 发送缓冲区大小 */
  g_tUart4.usRxBufSize = UART4_RX_BUF_SIZE; /* 接收缓冲区大小 */
  g_tUart4.usTxWrite = 0;                   /* 发送FIFO写索引 */
  g_tUart4.usTxRead = 0;                    /* 发送FIFO读索引 */
  g_tUart4.usRxWrite = 0;                   /* 接收FIFO写索引 */
  g_tUart4.usRxRead = 0;                    /* 接收FIFO读索引 */
  g_tUart4.usRxCount = 0;                   /* 接收到的新数据个数 */
  g_tUart4.usTxCount = 0;                   /* 待发送的数据个数 */
  g_tUart4.SendBefor = 0;                   /* 发送数据前的回调函数 */
  g_tUart4.SendOver = 0;                    /* 发送完毕后的回调函数 */
  g_tUart4.ReciveNew = 0; /* 接收到新数据后的回调函数 */
  g_tUart4.Sending = 0;   /* 正在发送中标志 */
#endif

#if UART5_FIFO_EN == 1
  g_tUart5.uart = UART5;                    /* STM32 串口设备 */
  g_tUart5.pTxBuf = g_TxBuf5;               /* 发送缓冲区指针 */
  g_tUart5.pRxBuf = g_RxBuf5;               /* 接收缓冲区指针 */
  g_tUart5.usTxBufSize = UART5_TX_BUF_SIZE; /* 发送缓冲区大小 */
  g_tUart5.usRxBufSize = UART5_RX_BUF_SIZE; /* 接收缓冲区大小 */
  g_tUart5.usTxWrite = 0;                   /* 发送FIFO写索引 */
  g_tUart5.usTxRead = 0;                    /* 发送FIFO读索引 */
  g_tUart5.usRxWrite = 0;                   /* 接收FIFO写索引 */
  g_tUart5.usRxRead = 0;                    /* 接收FIFO读索引 */
  g_tUart5.usRxCount = 0;                   /* 接收到的新数据个数 */
  g_tUart5.usTxCount = 0;                   /* 待发送的数据个数 */
  g_tUart5.SendBefor = 0;                   /* 发送数据前的回调函数 */
  g_tUart5.SendOver = 0;                    /* 发送完毕后的回调函数 */
  g_tUart5.ReciveNew = 0; /* 接收到新数据后的回调函数 */
  g_tUart5.Sending = 0;   /* 正在发送中标志 */
#endif

#if UART6_FIFO_EN == 1
  g_tUart6.uart = USART6;                   /* STM32 串口设备 */
  g_tUart6.pTxBuf = g_TxBuf6;               /* 发送缓冲区指针 */
  g_tUart6.pRxBuf = g_RxBuf6;               /* 接收缓冲区指针 */
  g_tUart6.usTxBufSize = UART6_TX_BUF_SIZE; /* 发送缓冲区大小 */
  g_tUart6.usRxBufSize = UART6_RX_BUF_SIZE; /* 接收缓冲区大小 */
  g_tUart6.usTxWrite = 0;                   /* 发送FIFO写索引 */
  g_tUart6.usTxRead = 0;                    /* 发送FIFO读索引 */
  g_tUart6.usRxWrite = 0;                   /* 接收FIFO写索引 */
  g_tUart6.usRxRead = 0;                    /* 接收FIFO读索引 */
  g_tUart6.usRxCount = 0;                   /* 接收到的新数据个数 */
  g_tUart6.usTxCount = 0;                   /* 待发送的数据个数 */
  g_tUart6.SendBefor = RS485_SendBefor;     /* 发送数据前的回调函数 */
  g_tUart6.SendOver = RS485_SendOver;       /* 发送完毕后的回调函数 */
  g_tUart6.ReciveNew = RS485_ReciveNew; /* 接收到新数据后的回调函数 */
  g_tUart6.Sending = 0;                 /* 正在发送中标志 */
#endif
}

