FlyyingPiggy2020/board/stm32f103/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*   函 数 名: bsp_SetUartParam
*   功能说明:
*配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-
*H7开发板 形    参: Instance   USART_TypeDef类型结构体 BaudRate   波特率 Parity
*校验类型，奇校验或者偶校验 Mode       发送和接收模式使能 返 回 值: 无
*********************************************************************************************************
*/
void comSetUartParam(USART_TypeDef *Instance, uint32_t BaudRate,
                     uint16_t WordLength, uint16_t StopBits, uint32_t Parity,
                     uint32_t Mode) {
  UART_HandleTypeDef UartHandle;

  /*##-1- 配置串口硬件参数 ######################################*/
  /* 异步串口模式 (UART Mode) */
  /* 配置如下:
    - 字长    = 8 位
    - 停止位  = 1 个停止位
    - 校验    = 参数Parity
    - 波特率  = 参数BaudRate
    - 硬件流控制关闭 (RTS and CTS signals) */

  UartHandle.Instance = Instance;

  UartHandle.Init.BaudRate = BaudRate;
  UartHandle.Init.WordLength = WordLength;
  UartHandle.Init.StopBits = StopBits;
  UartHandle.Init.Parity = Parity;
  UartHandle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  UartHandle.Init.Mode = Mode;
  UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;

  if (HAL_UART_Init(&UartHandle) != HAL_OK) {
    bsp_Error_Handler(__FILE__, __LINE__);
  }
}

/*
*********************************************************************************************************
*   函 数 名: InitHardUart
*   功能说明:
*配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-H7开发板
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
static void InitHardUart(void) {
  GPIO_InitTypeDef GPIO_InitStruct;

#if UART1_FIFO_EN == 1 /* 串口1 */
  /* 使能 GPIO TX/RX 时钟 */
  USART1_TX_GPIO_CLK_ENABLE();
  USART1_RX_GPIO_CLK_ENABLE();

  /* 使能 USARTx 时钟 */
  USART1_CLK_ENABLE();

  /* 配置TX引脚 */
  GPIO_InitStruct.Pin = USART1_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(USART1_TX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置RX引脚 */
  GPIO_InitStruct.Pin = USART1_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(USART1_RX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置NVIC the NVIC for UART */
  HAL_NVIC_SetPriority(USART1_IRQn, 0, 2);
  HAL_NVIC_EnableIRQ(USART1_IRQn);

  /* 配置波特率、奇偶校验 */
  comSetUartParam(USART1, UART1_BAUD, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX);

  CLEAR_BIT(USART1->SR, USART_SR_TC);   /* 清除TC发送完成标志 */
  CLEAR_BIT(USART1->SR, USART_SR_RXNE); /* 清除RXNE接收标志 */
  // USART_CR1_PEIE | USART_CR1_RXNEIE
  SET_BIT(USART1->CR1, USART_CR1_RXNEIE); /* 使能PE. RX接受中断 */
#endif

#if UART2_FIFO_EN == 1 /* 串口2 */
  /* 使能 GPIO TX/RX 时钟 */
  USART2_TX_GPIO_CLK_ENABLE();
  USART2_RX_GPIO_CLK_ENABLE();

  /* 使能 USARTx 时钟 */
  USART2_CLK_ENABLE();

  /* 配置TX引脚 */
  GPIO_InitStruct.Pin = USART2_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(USART2_TX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置RX引脚 */
  GPIO_InitStruct.Pin = USART2_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(USART2_RX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置NVIC the NVIC for UART */
  HAL_NVIC_SetPriority(USART2_IRQn, 0, 2);
  HAL_NVIC_EnableIRQ(USART2_IRQn);

  /* 配置波特率、奇偶校验 */
  comSetUartParam(USART2, UART2_BAUD, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX); // UART_MODE_TX_RX

  CLEAR_BIT(USART2->SR, USART_SR_TC);     /* 清除TC发送完成标志 */
  CLEAR_BIT(USART2->SR, USART_SR_RXNE);   /* 清除RXNE接收标志 */
  SET_BIT(USART2->CR1, USART_CR1_RXNEIE); /* 使能PE. RX接受中断 */
  SET_BIT(USART2->CR1, USART_CR1_IDLEIE);
#endif

#if UART3_FIFO_EN == 1 /* 串口3 */
  /* 使能 GPIO TX/RX 时钟 */
  USART3_TX_GPIO_CLK_ENABLE();
  USART3_RX_GPIO_CLK_ENABLE();

  /* 使能 USARTx 时钟 */
  USART3_CLK_ENABLE();

  /* 配置TX引脚 */
  GPIO_InitStruct.Pin = USART3_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(USART3_TX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置RX引脚 */
  GPIO_InitStruct.Pin = USART3_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(USART3_RX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置NVIC the NVIC for UART */
  HAL_NVIC_SetPriority(USART3_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(USART3_IRQn);

  /* 配置波特率、奇偶校验 */
  comSetUartParam(USART3, UART3_BAUD, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX);

  CLEAR_BIT(USART3->SR, USART_SR_TC);     /* 清除TC发送完成标志 */
  CLEAR_BIT(USART3->SR, USART_SR_RXNE);   /* 清除RXNE接收标志 */
  SET_BIT(USART3->CR1, USART_CR1_RXNEIE); /* 使能PE. RX接受中断 */
#endif

#if UART4_FIFO_EN == 1 /* 串口4 TX = PC10   RX = PC11 */
  /* 使能 GPIO TX/RX 时钟 */
  UART4_TX_GPIO_CLK_ENABLE();
  UART4_RX_GPIO_CLK_ENABLE();

  /* 使能 USARTx 时钟 */
  UART4_CLK_ENABLE();

  /* 配置TX引脚 */
  GPIO_InitStruct.Pin = UART4_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(UART4_TX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置RX引脚 */
  GPIO_InitStruct.Pin = UART4_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(UART4_RX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置NVIC the NVIC for UART */
  HAL_NVIC_SetPriority(UART4_IRQn, 0, 4);
  HAL_NVIC_EnableIRQ(UART4_IRQn);

  /* 配置波特率、奇偶校验 */
  comSetUartParam(UART4, UART4_BAUD, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX);

  CLEAR_BIT(UART4->SR, USART_SR_TC);     /* 清除TC发送完成标志 */
  CLEAR_BIT(UART4->SR, USART_SR_RXNE);   /* 清除RXNE接收标志 */
  SET_BIT(UART4->CR1, USART_CR1_RXNEIE); /* 使能RX接受中断 */
#endif

#if UART5_FIFO_EN == 1 /* 串口5 TX = PC12   RX = PD2 */
  /* 使能 GPIO TX/RX 时钟 */
  UART5_TX_GPIO_CLK_ENABLE();
  UART5_RX_GPIO_CLK_ENABLE();

  /* 使能 USARTx 时钟 */
  UART5_CLK_ENABLE();

  /* 配置TX引脚 */
  GPIO_InitStruct.Pin = UART5_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(UART5_TX_GPIO_PORT, &GPIO_InitStruct);

