FlyyingPiggy2020/board/stm32f103/src/bsp_uart_fifo.c
  /* 配置RX引脚 */
  GPIO_InitStruct.Pin = UART5_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(UART5_RX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置NVIC the NVIC for UART */
  HAL_NVIC_SetPriority(UART5_IRQn, 0, 5);
  HAL_NVIC_EnableIRQ(UART5_IRQn);

  /* 配置波特率、奇偶校验 */
  comSetUartParam(UART5, UART5_BAUD, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX);

  CLEAR_BIT(UART5->SR, USART_SR_TC);     /* 清除TC发送完成标志 */
  CLEAR_BIT(UART5->SR, USART_SR_RXNE);   /* 清除RXNE接收标志 */
  SET_BIT(UART5->CR1, USART_CR1_RXNEIE); /* 使能RX接受中断 */
#endif

#if UART6_FIFO_EN == 1 /* USART6 */
  /* 使能 GPIO TX/RX 时钟 */
  USART6_TX_GPIO_CLK_ENABLE();
  USART6_RX_GPIO_CLK_ENABLE();

  /* 使能 USARTx 时钟 */
  USART6_CLK_ENABLE();

  /* 配置TX引脚 */
  GPIO_InitStruct.Pin = USART6_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(USART6_TX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置RX引脚 */
  GPIO_InitStruct.Pin = USART6_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  HAL_GPIO_Init(USART6_RX_GPIO_PORT, &GPIO_InitStruct);

  /* 配置NVIC the NVIC for UART */
  HAL_NVIC_SetPriority(USART6_IRQn, 0, 6);
  HAL_NVIC_EnableIRQ(USART6_IRQn);

  /* 配置波特率、奇偶校验 */
  comSetUartParam(USART6, UART6_BAUD, UART_WORDLENGTH_8B, UART_STOPBITS_1,
                  UART_PARITY_NONE, UART_MODE_TX_RX);

  CLEAR_BIT(USART6->SR, USART_SR_TC);     /* 清除TC发送完成标志 */
  CLEAR_BIT(USART6->SR, USART_SR_RXNE);   /* 清除RXNE接收标志 */
  SET_BIT(USART6->CR1, USART_CR1_RXNEIE); /* 使能PE. RX接受中断 */
#endif
}

/*
*********************************************************************************************************
*   函 数 名: UartSend
*   功能说明:
*填写数据到UART发送缓冲区,并启动发送中断。中断处理函数发送完毕后，自动关闭发送中断
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
static int32_t UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen) {
  uint16_t i;

  for (i = 0; i < _usLen; i++) {
    /* 如果发送缓冲区已经满了，则等待缓冲区空 */
    while (1) {
      __IO uint16_t usCount;

      DISABLE_INT();
      usCount = _pUart->usTxCount;
      ENABLE_INT();

      if (usCount < _pUart->usTxBufSize) {
        break;
      } else if (usCount == _pUart->usTxBufSize) /* 数据已填满缓冲区 */
      {
        if ((_pUart->uart->CR1 & USART_CR1_TXEIE) == 0) {
          SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);
        }
      }
    }

    /* 将新数据填入发送缓冲区 */
    _pUart->pTxBuf[_pUart->usTxWrite] = _ucaBuf[i];

    DISABLE_INT();
    if (++_pUart->usTxWrite >= _pUart->usTxBufSize) {
      _pUart->usTxWrite = 0;
    }
    _pUart->usTxCount++;
    ENABLE_INT();
  }

  SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE); /* 使能发送中断（缓冲区空） */

  return i;
}

/*
*********************************************************************************************************
*   函 数 名: UartGetChar
*   功能说明: 从串口接收缓冲区读取1字节数据 （用于主程序调用）
*   形    参: _pUart : 串口设备
*             _pByte : 存放读取数据的指针
*   返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte) {
  uint16_t usCount;

  /* usRxWrite 变量在中断函数中被改写，主程序读取该变量时，必须进行临界区保护 */
  DISABLE_INT();
  usCount = _pUart->usRxCount;
  ENABLE_INT();

  /* 如果读和写索引相同，则返回0 */
  // if (_pUart->usRxRead == usRxWrite)
  if (usCount == 0) /* 已经没有数据 */
  {
    return 0;
  } else {
    *_pByte = _pUart->pRxBuf[_pUart->usRxRead]; /* 从串口接收FIFO取1个数据 */

    /* 改写FIFO读索引 */
    DISABLE_INT();
    if (++_pUart->usRxRead >= _pUart->usRxBufSize) {
      _pUart->usRxRead = 0;
    }
    _pUart->usRxCount--;
    ENABLE_INT();
    return 1;
  }
}

/*
*********************************************************************************************************
*   函 数 名: UartGetBuf
*   功能说明: 从串口接收缓冲区读取多个字节数据 （用于主程序调用）
*   形    参: _pUart : 串口设备
*             _pByte : 存放读取数据的指针
*   返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint16_t UartGetBuf(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen) {
  uint16_t usCount, usPos = 0;

  /* usRxWrite 变量在中断函数中被改写，主程序读取该变量时，必须进行临界区保护 */
  DISABLE_INT();
  if (_pUart->usRxCount == 0 && _pUart->usRxRead != _pUart->usRxWrite) {
    _pUart->usRxRead = _pUart->usRxWrite = 0;
  }
  usCount = _pUart->usRxCount;
  ENABLE_INT();

  /* 如果读和写索引相同，则返回0 */
  // if (_pUart->usRxRead == usRxWrite)
  if (usCount == 0) /* 已经没有数据 */
  {
    return 0;
  } else {
    /* 改写FIFO读索引 */
    DISABLE_INT();
    while (usCount > 0 && usPos < _usLen) {
      *_ucaBuf++ =
          _pUart->pRxBuf[_pUart->usRxRead]; /* 从串口接收FIFO取1个数据 */
      if (++_pUart->usRxRead >= _pUart->usRxBufSize) {
        _pUart->usRxRead = 0;
      }
      _pUart->usRxCount--;
      usCount--;
      usPos++;
    }
    ENABLE_INT();
    return usPos;
  }
}

/*
*********************************************************************************************************
*   函 数 名: UartGetChar
*   功能说明: 从串口接收缓冲区放入n字节数据 （用于主程序调用）
*   形    参: _pUart : 串口设备
*             _pByte : 存放读取数据的指针
*   返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint16_t UartSetBuf(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen) {
  uint16_t usCount = 0;

  DISABLE_INT();
  while (usCount < _usLen) {
    _pUart->pRxBuf[_pUart->usRxWrite] = _ucaBuf[usCount++];
    if (++_pUart->usRxWrite >= _pUart->usRxBufSize) {
      _pUart->usRxWrite = 0;
    }
    if (_pUart->usRxCount < _pUart->usRxBufSize) {
      _pUart->usRxCount++;
    }
  }
  ENABLE_INT();

  return usCount;
}

/*
*********************************************************************************************************
*   函 数 名: UartTxEmpty
*   功能说明: 判断发送缓冲区是否为空。
*   形    参:  _pUart : 串口设备
*   返 回 值: 1为空。0为不空。
*********************************************************************************************************
*/
uint8_t comTxEmpty(COM_PORT_E _ucPort) {
  UART_T *pUart;
  uint8_t Sending;

