FlyyingPiggy2020/board/stm32f103/src/bsp_uart_fifo.c
  pUart = ComToUart(_ucPort);
  if (pUart == 0) {
    return 0;
  }

  Sending = pUart->Sending;

  if (Sending != 0) {
    return 0;
  }
  return 1;
}

/*
*********************************************************************************************************
*   函 数 名: UartIRQ
*   功能说明: 供中断服务程序调用，通用串口中断处理函数
*   形    参: _pUart : 串口设备
*   返 回 值: 无
*********************************************************************************************************
*/
static void UartIRQ(UART_T *_pUart) {
  uint32_t isrflags = READ_REG(_pUart->uart->SR);
  uint32_t cr1its = READ_REG(_pUart->uart->CR1);
  uint32_t cr3its = READ_REG(_pUart->uart->CR3);

  /* 处理接收中断  */
  if ((isrflags & USART_SR_RXNE) != RESET) {
    /* 从串口接收数据寄存器读取数据存放到接收FIFO */
    uint8_t ch;

    ch = READ_REG(_pUart->uart->DR);
    if (_pUart->usRxCount < _pUart->usRxBufSize) {
      _pUart->pRxBuf[_pUart->usRxWrite] = ch;
      if (++_pUart->usRxWrite >= _pUart->usRxBufSize) {
        _pUart->usRxWrite = 0;
      }
      _pUart->usRxCount++;
    }

    /* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
    // if (_pUart->usRxWrite == _pUart->usRxRead)
    // if (_pUart->usRxCount == 1)
    {
      if (_pUart->ReciveNew) {
        _pUart->ReciveNew(_pUart->com,
                          ch); /* 比如，交给MODBUS解码程序处理字节流 */
      }
    }
  }

  /* 处理发送缓冲区空中断 */
  if (((isrflags & USART_SR_TXE) != RESET) &&
      (cr1its & USART_CR1_TXEIE) != RESET) {
    // if (_pUart->usTxRead == _pUart->usTxWrite)
    if (_pUart->usTxCount == 0) {
      /* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断
       * （注意：此时最后1个数据还未真正发送完毕）*/
      // USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);
      CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);

      /* 使能数据发送完毕中断 */
      // USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
      SET_BIT(_pUart->uart->CR1, USART_CR1_TCIE);
    } else {
      _pUart->Sending = 1;

      /* 从发送FIFO取1个字节写入串口发送数据寄存器 */
      // USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
      _pUart->uart->DR = _pUart->pTxBuf[_pUart->usTxRead];
      if (++_pUart->usTxRead >= _pUart->usTxBufSize) {
        _pUart->usTxRead = 0;
      }
      _pUart->usTxCount--;
    }
  }
  /* 数据bit位全部发送完毕的中断 */
  if (((isrflags & USART_SR_TC) != RESET) &&
      ((cr1its & USART_CR1_TCIE) != RESET)) {
    // if (_pUart->usTxRead == _pUart->usTxWrite)
    if (_pUart->usTxCount == 0) {
      /* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
      // USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
      CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TCIE);

      /* 回调函数,
       * 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
      if (_pUart->SendOver) {
        _pUart->SendOver(_pUart->com);
      }

      _pUart->Sending = 0;
    } else {
      /* 正常情况下，不会进入此分支 */

      /* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
      // USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
      _pUart->uart->DR = _pUart->pTxBuf[_pUart->usTxRead];
      if (++_pUart->usTxRead >= _pUart->usTxBufSize) {
        _pUart->usTxRead = 0;
      }
      _pUart->usTxCount--;
    }
  }
  if ((isrflags & USART_SR_IDLE) != RESET) {
    uint8_t ch;
    if (_pUart->IdleCallback != 0) {
      _pUart->IdleCallback();
    }
    ch = READ_REG(_pUart->uart->DR);
    CLEAR_BIT(_pUart->uart->SR, USART_SR_IDLE);
  }
}

/*
*********************************************************************************************************
*   函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler
*UART4_IRQHandler UART5_IRQHandler等 功能说明: USART中断服务程序 形    参: 无 返
*回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void) { UartIRQ(&g_tUart1); }
#endif

#if UART2_FIFO_EN == 1
void USART2_IRQHandler(void) { UartIRQ(&g_tUart2); }
#endif

#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void) { UartIRQ(&g_tUart3); }
#endif

#if UART4_FIFO_EN == 1
void UART4_IRQHandler(void) { UartIRQ(&g_tUart4); }
#endif

#if UART5_FIFO_EN == 1
void UART5_IRQHandler(void) { UartIRQ(&g_tUart5); }
#endif

#if UART6_FIFO_EN == 1
void USART6_IRQHandler(void) { UartIRQ(&g_tUart6); }
#endif

#if (PRINTF_MODE == PRINTF_UART) // 串口调试
/*
*********************************************************************************************************
*   函 数 名: fputc
*   功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f) {
#if 1 /* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
  comSendChar(COMx, ch);

  return ch;
#else /* 采用阻塞方式发送每个字符,等待数据发送完毕 */
  /* 写一个字节到USART1 */
  USART1->DR = ch;

  /* 等待发送结束 */
  while ((USART1->SR & USART_SR_TC) == 0) {
  }

  return ch;
#endif
}

/*
*********************************************************************************************************
*   函 数 名: fgetc
*   功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f) {
#if 1 /* 从串口接收FIFO中取1个数据, 非阻塞模式返回 */
  uint8_t ucData;

  if (comGetChar(COMx, &ucData) > 0) {
    return ucData;
  }
  return -1;
#else
#if 1 /* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
  uint8_t ucData;

  while (comGetChar(COMx, &ucData) == 0)
    ;

  return ucData;
#else
  /* 等待接收到数据 */
  while ((USART1->SR & USART_SR_RXNE) == 0) {
  }

  return (int)USART1->DR;
#endif
#endif
}
#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE)
 * *********************************/
